Revit 2024 API
MacroManager.GetMacroManager Method (Document)
 Gets the Macro manager from the document.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public static MacroManager GetMacroManager(
	Document document
)
Visual Basic
Public Shared Function GetMacroManager ( _
	document As Document _
) As MacroManager
Visual C++
public:
static MacroManager^ GetMacroManager(
	Document^ document
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document.
Return Value
 The new Macro manager object.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
MacroManager Class
GetMacroManager Overload
Autodesk.Revit.DB.Macros Namespace